Revit 2027 API
DimensionType.Prefix Property
 The prefix text for the dimension value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
member Prefix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The text goes immediately before the value and is not overridden by the possible instance prefix.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace